{
  "movieInfo": [
    {
      "id": "1",
      "time": "2h 46m",
      "name": "Dune: Part Two",
      "rating": 8.5,
      "description": "Paul Atreides unites with Chani and the Fremen while on a warpath of revenge against the conspirators who destroyed his family. Facing a choice between the love of his life and the fate of the known universe, he endeavors to prevent a terrible future only he can foresee.",
      "genre": "Action",
      "director": "Denis Villeneuve",
      "certificate": "12+",
      "country": "United States",
      "year": 2024,
      "likes": 10000,
      "imageUrl": "/images/1.jpg",
      "imageTitle": "/images/1(1).jpg",
      "alt": "Paul Atreides unites with Chani and the Fremen while seeking revenge against the conspirators who destroyed his family.",
      "trailer": "https://www.youtube.com/embed/Way9Dexny3w?si=ZOJbhe0PTTfpiRCu"
    },
    {
      "id": "2",
      "time": "2h 28m",
      "name": "Furiosa: A Mad Max Saga",
      "rating": 7.6,
      "description": "As the world fell, young Furiosa is snatched from the Green Place of Many Mothers and falls into the hands of a great Biker Horde led by the Warlord Dementus. Sweeping through the Wasteland they come across the Citadel presided over by The Immortan Joe. While the two Tyrants war for dominance, Furiosa must survive many trials as she puts together the means to find her way home.",
      "genre": "Thriller",
      "director": "George Miller",
      "certificate": "16+",
      "country": "Australia",
      "year": 2024,
      "likes": 9850,
      "imageUrl": "/images/2.jpg",
      "imageTitle": "/images/2(1).jpg",
      "alt": "The origin story of renegade warrior Furiosa before her encounter and teamup with Mad Max.",
      "trailer": "https://www.youtube.com/embed/XJMuhwVlca4?si=70cITsIW9y0GV4Sm"
    },
    {
      "id": "3",
      "time": "1h 55m",
      "name": "Ghostlight",
      "rating": 7.5,
      "description": "Ghostlight masterfully captures a family's journey through life with authentic performances and a compelling story, making it a must-see drama. The film can be a bit of a slow burn at times, but it is still an immensely moving character study on an ordinary dad who struggles to open up about his emotions. Each character in the film is uniquely complex and likeable.",
      "genre": "Drama",
      "director": "Kelly O'Sullivan",
      "certificate": "12+",
      "country": "United States",
      "year": 2024,
      "likes": 7390,
      "imageUrl": "/images/3.jpg",
      "imageTitle": "/images/3(1).jpg",
      "alt": "When a construction worker unexpectedly joins a local theater's production of Romeo and Juliet, the drama onstage starts to mirror his own life.",
      "trailer": "https://www.youtube.com/embed/R1TycuGX4Mw?si=kbp4-LHJVSG2fhVl"
    },
    {
      "id": "4",
      "time": "1h 49m",
      "name": "Civil War",
      "rating": 7.4,
      "description": "Civil War is a 2024 dystopian thriller film written and directed by Alex Garland. It follows a a8@team of journalists traveling from New York City to Washington, D.C. during a civil war fought across the United States between an authoritarian federal government and several regional factions.",
      "genre": "Adventure",
      "director": "Alex Garland",
      "certificate": "16+",
      "country": "United Kingdom",
      "year": 2024,
      "likes": 6782,
      "imageUrl": "/images/4.jpg",
      "imageTitle": "/images/4(1).jpg",
      "alt": "A journey across a dystopian future America, following a team of military-embedded journalists as they race against time to reach DC before rebel factions descend upon the White House.",
      "trailer": "https://www.youtube.com/embed/aDyQxtg0V2w?si=U3wJGjwFiRUkBF6x"
    },
    {
      "id": "5",
      "time": "2h 11m",
      "name": "Challengers",
      "rating": 7.2,
      "description": "From visionary filmmaker Luca Guadagnino, Challengers stars Zendaya as Tashi Duncan, a former tennis prodigy turned coach and a force of nature who makes no apologies for her game on and off the court. Married to a champion on a losing streak (Mike Faist - West Side Story), Tashi's strategy for her husband's redemption takes a surprising turn when he must face off against the washed-up Patrick (Josh O'Connor - The Crown) - his former best friend and Tashi's former boyfriend. As their pasts and presents collide, and tensions run high, Tashi must ask herself, what will it cost to win.",
      "genre": "Comedy",
      "director": "Luca Guadagnino",
      "certificate": "12+",
      "country": "Italy",
      "year": 2024,
      "likes": 6349,
      "imageUrl": "/images/5.jpg",
      "imageTitle": "/images/5(1).jpg",
      "alt": "Tashi, a former tennis prodigy turned coach, transformed her husband into a champion.",
      "trailer": "https://www.youtube.com/embed/VobTTbg-te0?si=6YfF_dc3YhzwuUJ7"
    },
    {
      "id": "6",
      "time": "2h 8m",
      "name": "Deadpool & Wolverine",
      "rating": 8.1,
      "description": "A listless Wade Wilson toils away in civilian life with his days as the morally flexible mercenary, Deadpool, behind him. But when his homeworld faces an existential threat, Wade must reluctantly suit-up again with an even more reluctant Wolverine.",
      "genre": "Action",
      "director": "Shawn Levy",
      "certificate": "16+",
      "country": "Canada",
      "year": 2024,
      "likes": 8324,
      "imageUrl": "/images/6.jpg",
      "imageTitle": "/images/6(1).jpg",
      "alt": "Deadpool is offered a place in the Marvel Cinematic Universe by the Time Variance Authority.",
      "trailer": "https://www.youtube.com/embed/73_1biulkYk?si=CtjHQMwwztdVBN7y"
    },
    {
      "id": "7",
      "time": "1h 45m",
      "name": "Beetlejuice Beetlejuice",
      "rating": 7.1,
      "description": "After an unexpected family tragedy, three generations of the Deetz family return home to Winter River. Still haunted by Beetlejuice, Lydia's life is turned upside down when her rebellious teenage daughter, Astrid, discovers the mysterious model of the town in the attic and the portal to the Afterlife is accidentally opened. With trouble brewing in both realms, it's only a matter of time until someone says Beetlejuice's name three times and the mischievous demon returns to unleash his very own brand of mayhem.",
      "genre": "Comedy",
      "director": "Tim Burton",
      "certificate": "12+",
      "country": "United States",
      "year": 2024,
      "likes": 5327,
      "imageUrl": "/images/7.jpg",
      "imageTitle": "/images/7(1).jpg",
      "alt": "After a family tragedy, three generations of the Deetz family return home to Winter River.",
      "trailer": "https://www.youtube.com/embed/As-vKW4ZboU?si=SybQgxFxsSnZP3hr"
    },
    {
      "id": "8",
      "time": "1h 29m",
      "name": "Good One",
      "rating": 7.2,
      "description": "During a weekend backpacking trip in the Catskills, 17-year-old Sam navigates the clash of egos between her father and his oldest friend.",
      "genre": "Drama",
      "director": "India Donaldson",
      "certificate": "12+",
      "country": "United States",
      "year": 2024,
      "likes": 5649,
      "imageUrl": "/images/8.jpg",
      "imageTitle": "/images/8(1).jpg",
      "alt": "During a weekend backpacking trip in the Catskills, 17-year-old Sam navigates the clash of egos between her father and his oldest friend.",
      "trailer": "https://www.youtube.com/embed/RGZNT7qgeG4?si=c04BroOgY7X9nsoS"
    },
    {
      "id": "9",
      "time": "2h 6m",
      "name": "The Fall Guy",
      "rating": 6.9,
      "description": "He's a stuntman, and like everyone in the stunt community, he gets blown up, shot, crashed, thrown through windows and dropped from the highest of heights, all for our entertainment. And now, fresh off an almost career-ending accident, this working-class hero has to track down a missing movie star, solve a conspiracy and try to win back the love of his life while still doing his day job. What could possibly go right?",
      "genre": "Romance",
      "director": "David Leitch",
      "certificate": "12+",
      "country": "Canada",
      "year": 2024,
      "likes": 4702,
      "imageUrl": "/images/9.jpg",
      "imageTitle": "/images/9(1).jpg",
      "alt": "A stuntman, fresh off an almost career-ending accident, has to track down a missing movie star.",
      "trailer": "https://www.youtube.com/embed/j7jPnwVGdZ8?si=otTeEkWjvZI1I28J"
    },
    {
      "id": "10",
      "time": "2h 1m",
      "name": "Monkey Man",
      "rating": 6.8,
      "description": "Inspired by the legend of Hanuman, an icon embodying strength and courage, Kid is an anonymous young man who ekes out a meager living in an underground fight club. There, night after night, he wears a gorilla mask and is beaten bloody by more popular fighters for cash. After years of suppressed rage, Kid discovers a way to infiltrate the enclave of the city's sinister elite. As his childhood trauma boils over, his mysteriously scarred hands unleash an explosive campaign of retribution to settle the score with the men who took everything from him.",
      "genre": "Thriller",
      "director": "Dev Patel",
      "certificate": "16+",
      "country": "India",
      "year": 2024,
      "likes": 4978,
      "imageUrl": "/images/10.jpg",
      "imageTitle": "/images/10(1).jpg",
      "alt": "An anonymous young man unleashes a campaign of vengeance against the corrupt leaders who murdered his mother and continue to systematically victimize the poor and powerless.",
      "trailer": "https://www.youtube.com/embed/g8zxiB5Qhsc?si=0H-tLCFORB0MF2J5"
    }
  ],
  "comments": [
    {
      "filmId": "5",
      "userName": "Alexander",
      "userComment": "Some comments for checking the operability of queries and function logic, vol. 2",
      "commentsTime": "23.09.2024, 00:29:11",
      "id": "6025"
    }
  ]
}